#### Terraform Format `success`
#### Terraform Initialization `success`
#### Terraform Validation `Success! The configuration is valid.

`
#### Terraform Plan `success`

<details><summary>Plan Output Shown Below:</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/raynaluzier/hts-cust-dev/runs/run-6re6SiXqKGj3XFw1

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.ubuntu-vm-again.random_shuffle.zone: Refreshing state... [id=-]
module.ubuntu-vm.random_shuffle.zone: Refreshing state... [id=-]
module.ubuntu-vm.aws_instance.vm: Refreshing state... [id=i-0280fe7d950002283]
module.ubuntu-vm-again.aws_instance.vm: Refreshing state... [id=i-0132c8fad5b1fcf43]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ubuntu-vm-again.aws_instance.vm has been deleted
  - resource "aws_instance" "vm" {
      - ami                                  = "ami-01b996646377b6619" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:402130074385:instance/i-0132c8fad5b1fcf43" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1c" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = true -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0132c8fad5b1fcf43" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "rel-hts-013122" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-05ee60225626929bf" -> null
      - private_dns                          = "ip-172-31-16-73.ec2.internal" -> null
      - private_ip                           = "172.31.16.73" -> null
      - public_dns                           = "ec2-54-82-119-115.compute-1.amazonaws.com" -> null
      - public_ip                            = "54.82.119.115" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "hts-test-sg",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-5990a514" -> null
      - tags                                 = {
          - "Application"  = "VM"
          - "BusinessUnit" = "Delivery"
          - "CostCenter"   = "1234567890"
          - "Environment"  = "Prod"
          - "Name"         = "hts-test-1-2"
          - "Product"      = "This is development work"
          - "SupportTeam"  = "hts.sre@domain.com"
        } -> null
      - tags_all                             = {
          - "Application"  = "VM"
          - "BusinessUnit" = "Delivery"
          - "CostCenter"   = "1234567890"
          - "Environment"  = "Prod"
          - "Name"         = "hts-test-1-2"
          - "Product"      = "This is development work"
          - "SupportTeam"  = "hts.sre@domain.com"
        } -> null
      - tenancy                              = "default" -> null
      - vpc_security_group_ids               = [
          - "sg-0b0b96cee9d31db80",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0cce3159161d290ab" -> null
          - volume_size           = 60 -> null
          - volume_type           = "gp3" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.linux-vm.data.aws_availability_zone.target will be read during apply
  # (config refers to values not yet known)
 <= data "aws_availability_zone" "target"  {
      + group_name           = (known after apply)
      + id                   = (known after apply)
      + name                 = (known after apply)
      + name_suffix          = (known after apply)
      + network_border_group = (known after apply)
      + opt_in_status        = (known after apply)
      + parent_zone_id       = (known after apply)
      + parent_zone_name     = (known after apply)
      + region               = (known after apply)
      + state                = (known after apply)
      + zone_id              = (known after apply)
      + zone_type            = (known after apply)

      + filter {
          + name   = "zone-name"
          + values = [
              + (known after apply),
            ]
        }
    }

  # module.linux-vm.aws_instance.vm will be created
  + resource "aws_instance" "vm" {
      + ami                                  = "ami-01b996646377b6619"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = true
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = "stop"
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "rel-hts-013122"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Application"  = "VM"
          + "BusinessUnit" = "Delivery"
          + "CostCenter"   = "1234567890"
          + "Environment"  = "Prod"
          + "Name"         = "hts-test-2"
          + "Product"      = "This is development work"
          + "SupportTeam"  = "hts.sre@domain.com"
        }
      + tags_all                             = {
          + "Application"  = "VM"
          + "BusinessUnit" = "Delivery"
          + "CostCenter"   = "1234567890"
          + "Environment"  = "Prod"
          + "Name"         = "hts-test-2"
          + "Product"      = "This is development work"
          + "SupportTeam"  = "hts.sre@domain.com"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0b0b96cee9d31db80",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = false
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 60
          + volume_type           = "gp3"
        }
    }

  # module.linux-vm.aws_network_interface.vm will be created
  + resource "aws_network_interface" "vm" {
      + arn                       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = (known after apply)
      + private_ips_count         = (known after apply)
      + security_groups           = [
          + "sg-0b0b96cee9d31db80",
        ]
      + source_dest_check         = true
      + subnet_id                 = "subnet-5990a514"
      + tags                      = {
          + "Application"  = "VM"
          + "BusinessUnit" = "Delivery"
          + "CostCenter"   = "1234567890"
          + "Environment"  = "Prod"
          + "Name"         = "hts-test-2"
          + "Product"      = "This is development work"
          + "SupportTeam"  = "hts.sre@domain.com"
        }
      + tags_all                  = {
          + "Application"  = "VM"
          + "BusinessUnit" = "Delivery"
          + "CostCenter"   = "1234567890"
          + "Environment"  = "Prod"
          + "Name"         = "hts-test-2"
          + "Product"      = "This is development work"
          + "SupportTeam"  = "hts.sre@domain.com"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.linux-vm.random_shuffle.az will be created
  + resource "random_shuffle" "az" {
      + id           = (known after apply)
      + input        = [
          + "use1-az1",
          + "use1-az2",
          + "use1-az4",
          + "use1-az6",
          + "use1-az3",
          + "use1-az5",
        ]
      + result       = (known after apply)
      + result_count = 1
    }

  # module.ubuntu-vm.aws_instance.vm will be destroyed
  # (because aws_instance.vm is not in configuration)
  - resource "aws_instance" "vm" {
      - ami                                  = "ami-01b996646377b6619" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:402130074385:instance/i-0280fe7d950002283" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = true -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0280fe7d950002283" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "rel-hts-013122" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-01d951f532869fa02" -> null
      - private_dns                          = "ip-172-31-83-26.ec2.internal" -> null
      - private_ip                           = "172.31.83.26" -> null
      - public_dns                           = "ec2-3-86-84-37.compute-1.amazonaws.com" -> null
      - public_ip                            = "3.86.84.37" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "hts-test-sg",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-4e096a6f" -> null
      - tags                                 = {
          - "Application"  = "VM"
          - "BusinessUnit" = "Delivery"
          - "CostCenter"   = "1234567890"
          - "Environment"  = "Prod"
          - "Name"         = "hts-test-1"
          - "Product"      = "This is development work"
          - "SupportTeam"  = "hts.sre@domain.com"
        } -> null
      - tags_all                             = {
          - "Application"  = "VM"
          - "BusinessUnit" = "Delivery"
          - "CostCenter"   = "1234567890"
          - "Environment"  = "Prod"
          - "Name"         = "hts-test-1"
          - "Product"      = "This is development work"
          - "SupportTeam"  = "hts.sre@domain.com"
        } -> null
      - tenancy                              = "default" -> null
      - vpc_security_group_ids               = [
          - "sg-0b0b96cee9d31db80",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0d596ee07d6925075" -> null
          - volume_size           = 60 -> null
          - volume_type           = "gp3" -> null
        }
    }

  # module.ubuntu-vm.random_shuffle.zone will be destroyed
  # (because random_shuffle.zone is not in configuration)
  - resource "random_shuffle" "zone" {
      - id           = "-" -> null
      - input        = [
          - "a",
          - "b",
          - "c",
          - "d",
          - "e",
          - "f",
        ] -> null
      - result       = [
          - "b",
        ] -> null
      - result_count = 1 -> null
    }

  # module.ubuntu-vm-again.random_shuffle.zone will be destroyed
  # (because random_shuffle.zone is not in configuration)
  - resource "random_shuffle" "zone" {
      - id           = "-" -> null
      - input        = [
          - "a",
          - "b",
          - "c",
          - "d",
          - "e",
          - "f",
        ] -> null
      - result       = [
          - "c",
        ] -> null
      - result_count = 1 -> null
    }

Plan: 3 to add, 0 to change, 3 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @raynaluzier, Action: `pull_request`, Working Directory: ``, Workflow: `Development Check and Validation`*